const menu = {
  "Гарячие напитки": [
  { name: "Еспрессо", sizes: { "350мл": 50} },
  { name: "Доппио", sizes: { "350мл": 65} },
  { name: "Флет Уайт", sizes: { "350мл": 85 } },
  { name: "Раф", sizes: { "350мл": 100 } },
  { name: "Фильтр-кофе", sizes: { "180мл": 55, "350мл": 70 } },
  { name: "Американо", sizes: { "180мл": 50, "350мл": 65 } },
  { name: "Американо с молоком", sizes: { "180мл": 65, "350мл": 85 } }
  ],
  "Холодные напитки": [
  { name: "Фрапучино", sizes: { "500мл": 105 } },
  { name: "Айс латте", sizes: { "500мл": 105 } },
  { name: "Айс латте на растительном молоке", sizes: { "500мл": 140 } },
  { name: "Еспрессо-тоник", sizes: { "300мл": 105, "500мл": 120 } },
  { name: "Хорнет", sizes: { "300мл": 140, "500мл": 170 } },
  { name: "Cold Brew", sizes: { "500мл": 120 } }
  ],
  "Фирменные чаи": [
  { name: "Облепиха-имбирь", sizes: { "450мл": 110 } },
  { name: "Ягодный с чебрецом", sizes: { "450мл": 110 } },
  { name: "Цитрусовый", sizes: { "450мл": 110 } },
  { name: "Малина-имбирь", sizes: { "450мл": 110 } },
  { name: "Мандарин-мята", sizes: { "450мл": 110 } },
  { name: "Вишня-эвкалипт", sizes: { "450мл": 110 } },
  { name: "Чай в ассортименте", sizes: { "450мл": 60 } }
  ],
   "Какао": [
  { name: "Какао с маршмеллоу", sizes: { "350мл": 95, "450мл": 110 } },
  { name: "Какао на растительном молоке", sizes: { "350мл": 110, "450мл": 145 } }
  ],
  "Молочные коктейли": [
  { name: "Ванильный", sizes: { "300мл": 125 } },
  { name: "Карамельный", sizes: { "300мл": 125 } },
  { name: "Шоколад-мята", sizes: { "300мл": 125 } },
  { name: "Клубника", sizes: { "300мл": 125 } },
  { name: "Сникерс", sizes: { "300мл": 150 } },
  { name: "Апельсиновый шейк", sizes: { "300мл": 150 } }
  ],
  "Десерты": [
  { name: "Синнабон", sizes: { "": 160 } },
  { name: "Апельсиновый кекс", sizes: { "": 85 } },
  { name: "Брауни", sizes: { "": 75 } },
  { name: "Брауни с фундуком", sizes: { "": 85 } },
  { name: "Овсяное с клюквой", sizes: { "": 45 } },
  { name: "Тыква-марципан", sizes: { "": 70 } },
  { name: "Кокосовое печенье", sizes: { "": 70 } },
  { name: "Миндальное с шоколадом", sizes: { "": 75 } },
  { name: "Печенье с нуттелой", sizes: { "": 60 } },
  { name: "Пряник матча", sizes: { "": 65 } },
  { name: "Фисташка-матча", sizes: { "": 95 } }
  ],
  "Капучино": [
  { name: "Классический", sizes: { "250мл": 70, "350мл": 85, "450мл": 110 } },
  { name: "Кедровый", sizes: { "250мл": 95, "350мл": 130, "450мл": 150 } },
  { name: "Миндальное молоко", sizes: { "250мл": 95, "350мл": 120, "450мл": 160 } },
  { name: "Соевое с бананом", sizes: { "250мл": 95, "350мл": 120, "450мл": 160 } },
  { name: "Кокосовое молоко", sizes: { "250мл": 95, "350мл": 120, "450мл": 160 } }
  ],
  "Фреш": [
  { name: "Апельсин", sizes: { "300мл": 140, "500мл": 170 } },
  { name: "Грейпфрут", sizes: { "300мл": 140, "500мл": 170 } },
  { name: "Микс", sizes: { "300мл": 140,"500мл": 170 } }
  ],
  "Латте": [
  { name: "Классический", sizes: { "450мл": 60 } },
  { name: "Солёная карамель", sizes: { "450мл": 75 } },
  { name: "Апельсиновая карамель", sizes: { "450мл": 75 } },
  { name: "Кокосовая карамель", sizes: { "450мл": 75 } },
  { name: "Миндальное молоко", sizes: { "450мл": 75 } },
  { name: "Соевое с бананом", sizes: { "450мл": 75 } },
  { name: "Кокосовое молоко", sizes: { "450мл": 75 } }
  ],
  "Лимонад": [
  { name: "Классический", sizes: { "700мл": 120 } },
  { name: "Клубника-базилик", sizes: { "700мл": 120 } },
  { name: "Смородина-грейпфрут", sizes: { "700мл": 120 } },
  { name: "Имбирный", sizes: { "700мл": 120 } },
  { name: "Sprits-On", sizes: { "700мл": 120 } },
  { name: "Манго-маракуйя", sizes: { "700мл": 120 } },
  { name: "Грейпфрут-барбарис", sizes: { "700мл": 120 } },
  { name: "Матча-маракуйя", sizes: { "700мл": 120 } }
  ],
  "Матча": [
  { name: "Матча чай", sizes: { "450мл": 60 } },
  { name: "Матча тоник", sizes: { "450мл": 75 } },
  { name: "Матча латте", sizes: { "450мл": 75 } },
  { name: "Матча латте на растительном молоке", sizes: { "450мл": 75 } },
  { name: "Матча фреш", sizes: { "450мл": 75 } }
  ]
};
const container = document.querySelector("main");
Object.entries(menu).forEach(([category, drinks]) => {
let card = document.createElement("div");
card.className = "drinksCard";
let sizeLabels = Object.keys(drinks[0].sizes).join(" / ");
card.innerHTML = `
<div class="Name-Size">
<h1>${category}</h1>
<span>${sizeLabels}</span>
</div>
`;
drinks.forEach(drink => {
let item = document.createElement("div");
item.className = "itemName";
let prices = Object.values(drink.sizes)
.map(p => `<div class="price">${p}</div>`)
.join("/");
item.innerHTML = `
<div class="drinkName">${drink.name}</div>
<div class="dots"></div>
<div class="prices">${prices}</div>
`;
card.appendChild(item);
});
container.appendChild(card);
});